* File Comparison

There is one minor complication which is that I don't save the Sentinel 1 velocity ZIP files, only the extracted NetCDF data. Therefore we are not directly comparing two directory lists, but rather two lists based on a subset of the filename.

A list of the local Sentinel velocities:
#+BEGIN_SRC sh :results verbatim
cd ${DATADIR}/Sentinel1/Sentinel1_IV_maps
ls | cut -d"." -f1 | tail -n3
#+END_SRC
#+RESULTS:
: IV_20190909_20191003
: IV_20190921_20191015
: IV_20191003_20191027

A list of the files on the Promice Data Portal
1. Manually go to https://www.promice.org/PromiceDataPortal/#Sentinel1Greenlandicevelocity
2. https://promice.org/PromiceDataPortal/api/download/92ce7cf4-59b8-4a3f-8f75-93d166f5a7ca/Greenland_IV

List contents there
#+BEGIN_SRC sh :results verbatim
URL=https://promice.org/PromiceDataPortal/api/download/92ce7cf4-59b8-4a3f-8f75-93d166f5a7ca/Greenland_IV
curl -s ${URL} --list-only | grep \.nc | sed -e 's/<[^>]*>//g' | cut -d"." -f1 | tail -n3
#+END_SRC
#+RESULTS:
:     IV_20190909_20191003
:     IV_20190921_20191015
:     IV_20191003_20191027

